Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དུས་གསུམ་ཀུན་ལ་ཁོ་མོ་ཞུགས་གྱུར་པས། །སངས་རྒྱས་རྒྱ་མཚོ་ཀུན་ཀྱང་མཐོང་ཞིང་ཤེས། །དེ་དག་སྨོན་ལམ་ལ་ཡང་རབ་ཏུ་ཞུགས། །
en: {18} “Comprehending all three times, I see and know an ocean of buddhas And comprehend their prayers.

source: ཚུལ་འདི་དཔག་ཡས་རབ་ཏུ་རྫོགས་པ་ཡིན། །
en: This way is measureless and perfect.

source: རྡུལ་མང་ཀུན་ལ་ཞིང་རྣམས་རྒྱ་མཚོ་མཐོང་། །དེ་དག་དུས་གསུམ་འཇུག་པ་དེ་བཞིན་ཏེ། །
en: {19} “I see an ocean of realms within all atoms And their entry into the three times.

source: དེ་དག་ཀུན་གྱི་སངས་རྒྱས་རྒྱ་མཚོ་མཐོང་། །འདི་ནི་ཀུན་ཏུ་གནས་པའི་ཚུལ་གྱིས། །
en: I see within them an ocean of buddhas And the level of their way that is present everywhere.

source: རྣམ་པར་སྣང་མཛད་བྱང་ཆུབ་སངས་རྒྱས་ཏེ། །ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་རྣམས་ཡོངས་བཀང་ཞིང་། །
en: {20} “See how the enlightenment, the buddhahood, of Vairocana Pervades the realms in all directions.

source: རྡུལ་སྦུབས་ཀུན་གྱི་བྱང་ཆུབ་ཤིང་དྲུང་ན། །ཞི་བའི་ཆོས་རྣམས་གསུང་དུ་སྒྲོག་པ་ལྟོས། །
en: Within every atom, at the foot of a Bodhi tree, He is speaking of the Dharma of peace.”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ནས། ཇི་སྲིད་ཅིག་ལགས།
en: {21} Then Sudhana, the head merchant’s son, asked Vāsantī, the goddess of the night, “Goddess, how long has it been since you have been established in the highest, complete enlightenment?

source: དེ་ལྟར་ཁྱོད་ཚུལ་འདི་ལྟ་བུས་སེམས་ཅན་གྱི་དོན་བགྱི་བ་ལ་སྟ་གོན་དུ་ཞུགས་པའི་རྣམ་པར་ཐར་པ་དེ་ནི་ཁྱོད་ཀྱིས་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: How long has it been since you attained this liberation through which you have become established in accomplishing the benefit of beings in this way?”

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པའི་ཡང་། ཕ་རོལ་ཅིག་ཏུ་བསྐལ་བ་རབ་ཏུ་ཞི་བའི་འོད་ཅེས་བྱ་བ། སངས་རྒྱས་བྱེ་བ་ཕྲག་ལྔ་བརྒྱ་སྐྱེས་པ་བྱུང་སྟེ། དེའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་རིན་ཆེན་དཔལ་འབྱུང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Vāsantī, the goddess of the night, answered, “Noble one, beyond and even more beyond as many past kalpas as there are atoms in Sumeru, during a kalpa called Praśantaprabha, there was a world realm called Ratna­śrī­saṃbhava in which there appeared five thousand million buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་གླིང་བཞི་པ་འབྲིང་པོ་རིན་ཆེན་ཟླ་བ་སྒྲོན་མའི་འོད་ཅེས་བྱ་བ་དེ་ན། རྒྱལ་པོའི་གནས་པད་མོའི་འོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: Within that world realm there was a medium-sized four-continent world called Ratna­candra­pradīpa­prabhā, the capital of which was called Padmaprabhā.

source: རྒྱལ་པོའི་གནས་དེར་རྒྱལ་པོ་ཆོས་རབ་མུ་སྟེགས་ཞེས་བྱ་བ་ཆོས་དང་མཐུན་པའི་རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ་གླིང་བཞི་ལ་དབང་བ་རིན་པོ་ཆེ་བདུན་དང་ལྡན་པ་བྱུང་སྟེ།
en: In that capital city there was King Sudharmatīrtha, who was a cakravartin Dharma king who ruled over the four continents and possessed the seven jewels.

source: དེས་ས་ཆེན་པོ་དེ་ཡང་རི་དང་རྒྱ་མཚོར་བཅས་པའི་མཐས་གཏུགས་པར་ཆོས་ཀྱིས་རྒྱས་པར་བྱས་ནས། བདེ་བར་གནས་པར་བྱས་སོ། །
en: He spread the Dharma over the mountains and seas of that great world up to its edges and made it happy.

source: རྒྱལ་པོ་ཆོས་རབ་མུ་སྟེགས་དེའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: King Sudharmatīrtha had a queen named Dharma­mati­candrā.

source: དེ་སྲོད་ལ་འདོད་པས་མྱོས་ཤིང་དགའ་བར་རྩེ་རྩེ་བས་དུབ་ནས་ནམ་གྱི་གུང་ལ་བཙུན་མོའི་འཁོར་གྱི་གནས་སུ་ཕྱིན་ཏེ་ཉལ་ལོ། །
en: At dusk, intoxicated by desire and exhausted by bliss, she returned to the harem at midnight and went to sleep.

source: དེ་ནས་རྒྱལ་པོའི་གནས་པད་མོའི་འོད་དེའི་ཤར་ཕྱོགས་ཀྱི་ནགས་ཚལ་ཆེན་པོ་ཞི་བའི་དཔལ་འབྱུང་བ་ཞེས་བྱ་བར་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྒྱན་ཐམས་ཅད་ཀྱི་འོད་དང་ལྡན་པའི་ལྷུན་ཅན། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བའི་བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོའི་དྲུང་དུ།
en: To the east of the capital city of Padmaprabhā there was a great forest called Śamatha­śrī­sambhava, in which appeared a tathāgata by the name of Sarva­dharma­nigarjita­rāja, whose body shone with the light of all kings of jewels and was the miraculous manifestation of all the buddhas.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས།
en: At the foot of a Bodhi tree, he attained the highest, complete enlightenment of buddhahood.

source: དེའི་མཐུས་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་དཔལ་འབྱུང་བ་ཐམས་ཅད་འོད་ཆེན་པོ་ཁ་དོག་ཏུ་མ་ཅན་གྱིས་རྒྱས་ཤིང་སང་བར་གྱུར་ཏོ། །
en: Through the power of that, a great light of many colors filled the world realm of Ratna­śrī­saṃbhava.

source: རྒྱལ་པོའི་གནས་པད་མོའི་འོད་ཅེས་བྱ་བ་དེ་ན་མཚན་མོའི་ལྷ་མོ་ཟླ་བ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བ་འདུག་འདུག་སྟེ།
en: In the capital city of Padmaprabhā there was a goddess of the night called Suviśuddha­candrābhā.

source: དེས་རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བའི་གན་དུ་སོང་ནས། རྒྱན་བཀྲོལ་བའི་སྒྲས་སད་པར་བྱས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འདི་ལྟར་རྒྱལ་པོའི་བཙུན་མོ་ཤེས་པར་གྱིས་ཤིག །
en: She approached Dharma­mati­candrā, the king’s queen, woke her with the sound of rattling her jewelry, and said to her, ‘Know this, queen of the king!

source: ནགས་ཚལ་ཆེན་པོ་ཞི་བའི་དཔལ་འབྱུང་བར་དེ་བཞིན་གཤེགས་པ་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྒྲོག་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །
en: The Tathāgata Sarva­dharma­nigarjita­rāja has attained the highest, complete enlightenment of buddhahood in the great forest Śamatha­śrī­sambhava.’

source: དེ་ནས་དེས་རྒྱལ་པོའི་བཙུན་མོ་དེའི་མདུན་དུ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྔགས་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་རྒྱ་ཆེར་བཤད་དོ། །
en: Then, in front of the king’s queen she praised the qualities of the buddha and described at length the miraculous manifestations of the buddhas and the completely good conduct and prayer of the bodhisattvas.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོའི་བཙུན་མོ་དེ་འང་དེ་བཞིན་གཤེགས་པའི་འོད་ཀྱིས་སྣང་བར་གྱུར་ཏེ། བསམ་པ་ཐག་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས།
en: “Noble one, the king’s queen was illuminated by the light from that tathāgata, and she sincerely entered into the path to the highest, complete enlightenment.

source: དེས་དེ་བཞིན་གཤེགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དུ་བཅས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་ཆེར་བྱས་སོ། །
en: She made offerings to that tathāgata and his saṅgha of bodhisattvas and śrāvakas.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: “What do you think, noble one?

source: དེའི་ཚེ་དེའི་དུས་ཀྱི་རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི།
en: At that time, in that time, who was that king’s queen, Dharma­mati­candrā?

source: དེ་ལྟར་མི་བལྟ་སྟེ། ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོའི་བཙུན་མོ་ཆོས་ཀྱི་བློ་གྲོས་ཟླ་བ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Do not think that it was anyone else, for at that time, in that time, I was the king’s queen, Dharma­mati­candrā.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་མོས་བའི་སེམས་བསྐྱེད་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་བསྐྱེད་བའི་དགེ་བའི་རྩ་བ་དེས། བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཚུན་ཆད་དུ་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མ་སྐྱེས་ཏེ།
en: “Noble one, under that tathāgata I developed the motivation of aspiration and created roots of merit so that for kalpas as numerous as the atoms in Sumeru I never fell into rebirth in the lower realms.

source: སེམས་ཅན་དམྱལ་བར་མ་ཡིན་ནོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་མ་ཡིན།
en: I was never reborn as a denizen of hell, as an animal, or as a preta.

source: ཡི་དགས་སུ་མ་ཡིན་ནོ། །ནམ་ཡང་རིགས་དམའ་བར་མ་སྐྱེས་སོ། །
en: I was never reborn in an inferior family.

source: ནམ་ཡང་དབང་པོ་དང་མི་ལྡན་པར་མ་གྱུར་ཏོ། །
en: I was never reborn as someone without sensory faculties.

source: ནམ་ཡང་སྡུག་བསྔལ་བར་མ་གྱུར་ཏེ།
en: I was never someone who suffered.

source: དེ་ལྟར་ཁོ་མོས་རྟག་པར་ལྷའི་ནང་དུ་ལྷའི་བདག་ཉིད་ཆེ་བ་ཉིད་ཐོབ། མིའི་ནང་དུ་ནི། མིའི་བདག་ཉིད་ཆེ་བ་ཉིད་ཐོབ་སྟེ།
en: I always attained the state of a great deity among deities, and a great human among humans.

source: འདི་ལྟར་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་བཤེས་གཉེན་དང་ཡང་མ་བྲལ་ལོ། །
en: In this way, I was never apart from buddhas and bodhisattva kalyāṇamitras.

source: དུས་ངན་པར་ཡང་མ་སྐྱེས་སོ། །
en: I was never reborn in a bad time.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་དགེ་བའི་རྩ་བ་བསྐྱེད་དེ་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་ལམ་བདེ་ཞིང་མཉམ་པ་ནས་ཉེ་ཞོ་མེད་པར་ཕྱིན་ཀྱང་དེ་ཙམ་གྱིས་ཁོ་མོའི་བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཡོངས་སུ་གྲུབ་པར་མ་གྱུར་ཏེ། རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་དེ་དག་ནི་འདས།
en: “Noble one, in that way, I created roots of merit under one buddha after another, and for as many kalpas as there are atoms in Sumeru, I traveled on easy and level paths without any impediment, but I had not yet accomplished the powers of a bodhisattva.

source: བསྐལ་པ་བཟང་པོ་འདིའི་སྔ་རོལ་གྱི་ནི་བསྐལ་པ་ཆེན་པོ་སྟོང་ཕྲག་བཅུའི་ཐོག་མ་ལ་བབ་པ་དེའི་ཚེ། འཇིག་རྟེན་གྱི་ཁམས་གཟི་བརྗིད་རྡུལ་གྱི་དྲི་མ་མྱེད་པ་ཞེས་བྱ་བར། བསྐལ་པ་མྱ་ངན་མེད་ཅིང་། རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: When those kalpas as numerous as the atoms in Sumeru had passed, ten thousand great kalpas before this Bhadra kalpa, at the time of the first of those kalpas, which was called Aśokaviraja, there was a world realm called Rajovimala­tejaḥśrī.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་གཟི་བརྗིད་རྡུལ་གྱི་དྲི་མ་མེད་པའི་དཔལ་དེ་ནི། ཀུན་ནས་ཉོན་མོངས་ལ་རྣམ་པར་དག་པར་གྱུར་ཏེ། དེར་སངས་རྒྱས་ལྔ་བརྒྱ་བྱུང་ངོ་། །སངས་རྒྱས་ལྔ་བརྒྱ་པོ་དེ་དག་གི་ཐོག་མ་ལ་དེ་བཞིན་གཤེགས་པ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ།
en: “Noble one, that world realm Rajovimala­tejaḥśrī was completely pure of the kleśas, and five hundred buddhas appeared within it.

source: འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རི་རབ་རྒྱལ་མཚན་སྤྱན་ཡངས་ཤིང་ཞི་བའི་དཔལ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: The first of those five hundred buddhas was a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat, who was named Sumeru­dhvajāyatana­śānta­netra­śrī.

source: དེའི་ཚེ་ཁོ་མོ་ཡང་ཚོང་དཔོན་སྙན་པ་རྣམ་པར་གྲགས་པའི་བུ་མོ་ཤེས་རབ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ།
en: At that time, I was Prajñāvabhāsa­śrī, the daughter of the head merchant Vighuṣṭakīrti.

source: གཟུགས་མཛེས་ཤིང་བཟང་ལ་བལྟ་ན་སྡུག་པ་ཁ་དོག་ཤིན་ཏུ་མཛེས་ཤིང་རྒྱས་པ་དང་ལྡན་པ་ཞིག་ཏུ་གྱུར་ཏེ།
en: I was beautiful and attractive, a delight to see, with a very beautiful, perfect complexion.

source: མཚན་མོའི་ལྷ་མོ་ཟླ་བ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་འོད་ཅེས་བྱ་བ་དེ་ཡང་། སྨོན་ལམ་གྱི་དབང་གིས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་དང་བྲལ་བའི་རྒྱལ་པོའི་གནས་རྒྱལ་མཚན་སྣ་ཚོགས་སུ་མཚན་མོའི་ལྷ་མོ་མིག་རྣམ་པར་དག་པ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: “The goddess of the night called Suviśuddha­candrābhā, through the power of her prayers, had become the goddess of the night called Viśuddha­netrābhā in Vicitra­dhvaja, the capital of the four-continent world realm named Virajovatī.

source: དེས་ཁོ་མོ་མཚན་མོ་མི་ཉལ་ཙམ་ཞིག་ན། ཕ་མ་ཉལ་བར་གྱུར་པ་དང་། ཁྱིམ་དེ་ཡང་ཡོངས་སུ་བསྐྱོད་དེ་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས་རང་གི་གཟུགས་བསྟན་ཏེ། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསྔགས་པ་བརྗོད་ནས།
en: At night, while I was not yet asleep and my parents were asleep, she shook our house, illuminated it with a great light, revealed her own form to me, and praised the qualities of the buddhas.

source: དེ་བཞིན་གཤེགས་པ་ཐོག་མ་མངོན་པར་སངས་རྒྱས་ནས། ཞག་བདུན་ལོན་ཏེ། སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་པ་དེ་བསྟནཏོ། །
en: She revealed the tathāgata residing at the bodhimaṇḍa seven days after he had attained buddhahood.

source: དེ་ནས་ཁོ་མོ་ཕ་མ་དང་གཉེན་བཤེས་ཀྱི་ཚོགས་ཆེན་པོ་དང་འགྲོགས་ཏེ། མཚན་མོའི་ལྷ་མོ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཟླ་བའི་འོད་སྔོན་དུ་བདར་ནས། དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔར་ཕྱིན་ཏོ། །
en: “Then, accompanied by my parents and a great crowd of my family, and preceded by Viśuddha­netrābhā, the goddess of the night, I went into the presence of that tathāgata.

source: དེ་ནས་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་མཐོང་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་འགྲོ་བ་འདུལ་ཞིང་སངས་རྒྱས་མཐོང་བར་བྱེད་པ་ཞེས་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་དུས་གསུམ་གྱི་དབྱིངས་ཡེ་ཤེས་ཀྱིས་སྣང་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཡང་ཐོབ་པར་གྱུར་ཏོ། །
en: I then made vast offerings to the Tathāgata, and as soon as I saw the Tathāgata’s face, I attained the samādhi called guiding beings and seeing the Buddha’s face and the samādhi called the domain illuminated by the wisdom of the range of the three times.

source: དེ་ཐོབ་པས་ཀྱང་ཁོ་མོས་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ཀྱང་རྗེས་སུ་དྲན་པར་གྱུར་ཏོ། །
en: Through attaining them I remembered as many kalpas as there are atoms in Sumeru.

source: ཁོ་མོའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་མངོན་དུ་གྱུར་ཏེ།
en: My aspiration to enlightenment manifested.

source: དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་ལས་ཆོས་བསྟན་པ་ཐོས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་ཡང་ཐོབ་པར་གྱུར་ཏོ། །
en: In that way, I heard the Dharma from that tathāgata, and I attained the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings.

source: དེ་ཐོབ་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་ཞིང་། བདག་ཉིད་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པར་ཤེས་སོ། །
en: Through attaining that, I pervaded with my body as many worlds as there are atoms in ten buddha realms, and there appeared to my sight all the buddhas who were present in those worlds, and I knew that I was present at the feet of all of them.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་སེམས་ཅན་ཇི་སྙེད་ཅིག་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ། དེ་དག་གི་སྒྲ་སྐད་རྣམ་པ་ཐ་དད་པའི་བརྡ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: All of the beings who had been born in those world realms appeared to my sight, and I knew all the symbols of their different languages.

source: སེམས་དང་བསམ་པ་དང་། དབང་པོ་དང་མོས་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I knew their minds, thoughts, faculties, and aspirations.

source: སྔོན་གྱི་མཐའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱི་དྲུང་དུ་ཡོངས་སུ་སྨིན་པར་གྱུར་པའང་རབ་ཏུ་ཤེས་སོ། །
en: I knew the past kalyāṇamitras in whose presence they were ripened.

source: དེ་དག་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་འགྱུར་བའི་ལུས་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ། །
en: I manifested to them the bodies that satisfied them according to their aspirations.

source: ཁོ་མོའི་རྣམ་པར་ཐར་པ་དེ་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་རྣམ་པར་འཕེལ་ཏེ།
en: That liberation of mine increased with each instant of the mind.

source: རྣམ་པར་ཐར་པའི་སེམས་དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །
en: Through the instant of mind that followed that instant of mind of liberation, my body pervaded as many buddha realms as there are atoms in a hundred world realms.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །
en: Through the next instant of mind, my body pervaded as many buddha realms as there are atoms in a thousand world realms.

source: དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །དེ་བཞིན་དུ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དག་ཀྱང་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །
en: Through the next instant of mind, my body pervaded as many buddha realms as there are atoms in a hundred thousand world realms, and so on, up to my body pervading, in each instant of mind, as many buddha realms as there are atoms in an anabhilāpyānabhilāpya of world realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ། བདག་ཉིད་ཀྱང་དེ་དག་གི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པར་ཤེས་སོ། །
en: There appeared to my sight all the buddhas that were present in those worlds, and I knew that I was present at the feet of all of them.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལེན་ཏོ། །
en: I obtained all the Dharma that was taught by those buddha bhagavats.

source: འཛིན་ཏོ། །ཡོངས་སུ་འཛིན་ཏོ། །
en: I possessed it, kept it, preserved it.

source: ཉེ་བར་འཛིན་ཏོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྔོན་གྱི་ཚུལ་རྒྱ་མཚོ་དང་། སྨོན་ལམ་རྒྱ་མཚོ་ལ་ཡང་འཇུག་གོ །
en: I comprehended the past ocean of ways and ocean of prayers of those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར། མངོན་པར་སྒྲུབ་བོ། །
en: All those buddha realms purified by those tathāgatas were created in order to purify their own buddha realms.

source: སེམས་ཅན་ཇི་སྙེད་ཅིག་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དག་དུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ།
en: All of the beings who had been born in those world realms appeared to my sight.

source: སེམས་ཅན་དེ་དག་གི་བསམ་པ་དང་དབང་པོ་དང་མོས་པའི་བྱེ་བྲག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་བྱེ་བྲག་དུ་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཕྱིར་ལུས་བྱིན་གྱིས་རློབ་སྟེ།
en: I blessed my body in order to ripen and guide all of their different minds, thoughts, faculties, and aspirations.

source: དེ་ལྟར་ཁོ་མོའི་རྣམ་པར་ཐར་པ་དེ་ནི་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་ཆོས་ཀྱི་དབྱིངས་འབྱམ་ཀླས་པ་རྒྱས་པར་འགེངས་པའི་ཚུལ་གྱིས་རྣམ་པར་འཕེལ་ལོ། །
en: “Thus, the way in which my liberation pervaded the entire extent of the realm of phenomena increased with each instant of mind.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་དང་དབུས་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བ། ཆོས་ཀྱི་དབྱིངས་རྒྱ་མཚོའི་ཚུལ་འབྱམ་ཀླས་པར་འདལ་བ་ལ་འཇུག་པར་དབང་སྒྱུར་བ། བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པར་བསྒྲུབ་པའི་ཏིང་ངེ་འཛིན་ཡེ་ཤེས་རྡོ་རྗེའི་དཔལ་གྱིས་རྣམ་པར་རྩེ་བ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བ་ལ་སྨོན་ལམ་ཆེན་པོས་བྱུང་བ།
en: “Noble one, I know only this bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings.

source: འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཡོངས་སུ་དག་པར་བྱ་བའི་བསོད་ནམས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ཡོངས་སུ་གྲུབ་པ། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཡེ་ཤེས་ལ་དབང་བསྒྱུར་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པའི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བའི་ཡེ་ཤེས་ཀྱི་ཉི་མའི་མིག་དང་ལྡན་པ། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ལ་ཐེག་པ་ཆེན་པོ་རྣམ་པར་དམིགས་པར་བྱ་བའི་མཐུ་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་དང་།
en: How could I know the conduct or describe the qualities of bodhisattvas who have arisen from the completely good bodhisattva conduct and prayers that have no middle or edge; who have the power to enter the entire extent of the ways of the ocean of the realm of phenomena; who play in the samādhi called the glorious vajra of wisdom, which is attained by bodhisattvas who have arisen from the great prayers to be in the care of all the families of tathāgatas in all world realms; who have accomplished a great ocean of merit that purified in an instant of mind the vast extent of world realms; who in each instant of mind ripen all the realms of beings; who have the eyes of the sun of wisdom that dispels all the darkness of the obscurations of all beings in all the world realms that are under the power of their guiding wisdom; who have the power to communicate the Mahāyāna to all the realms of beings; who possess the moon of intelligence that dispels the darkness of doubt, uncertainty, and equivocation within all beings; who have the pure domain of speech that lifts beings from attachment to the entire ocean of existence; who have the power to manifest emanations in the atoms throughout the entire realm of phenomena; and who are inseparable from the domain of the knowledge of the entire range of the three times?

source: ནེམ་ནུར་དང་། ཡིད་གཉིས་ཀྱི་རབ་རིབ་རྣམ་པར་སེལ་བའི་བློ་གྲོས་ཀྱི་ཟླ་བ་དང་ལྡན་པ། སྲིད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ལ་མངོན་པར་ཆགས་པ་ལས་གྱེན་དུ་བསྐྱོད་པའི་སྒྲ་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱིས་རྡུལ་གྱི་ཆ་ཤས་ལ་རྣམ་པར་འཕྲུལ་བ། ཡོངས་སུ་སྟོན་པ་ལ་དབང་བསྒྱུར་བ། དུས་གསུམ་གྱི་དབྱིངས་ཀྱི་དཀྱིལ་འཁོར་ལ་ཡེ་ཤེས་དབྱེར་མེད་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པའམ། སྤྱོད་ཡུལ་ལ་འཇུག་པའམ། རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བ་ཡོངས་སུ་བསྟན་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ཡུལ་མ་ག་དྷ་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ལ་ཁོ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་བསྐྱེད་པ། ཡང་དང་ཡང་བསྐུལ་བསྐུལ་བའི་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: At the bodhimaṇḍa in this land of Magadha there is the goddess of the night called Samanta­gambhīra­śrī­vimala­prabhā, whom I have inspired again and again to develop the aspiration for the highest, complete enlightenment.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྱིས། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །ཁྱོད་སྐུ་ཤིན་ཏུ་རྣམ་པར་དག་པ་མཐོང་། །མཚན་གྱིས་རྣམ་བརྒྱན་རི་བོ་ཇི་བཞིན་དུ། །འཇིག་རྟེན་ཀུན་ལས་མངོན་འཕགས་འཇིག་རྟེན་དུ། །
en: Then Sudhana, the head merchant’s son, praised the night goddess Vāsantī with these verses: “I see the purity of your body Adorned by signs, like Meru, Superior to all worlds; within the world You have a perfect body as beautiful as Mañjuśrī’s.

source: ཕུན་སུམ་ཚོགས་སྐུ་འཇམ་དཔལ་བཞིན་དུ་མཛེས། །ཁྱོད་ཀྱི་ཆོས་སྐུ་ཤིན་ཏུ་རྣམ་དག་སྟེ། །དུས་གསུམ་ཀུན་ཏུ་མཉམ་ཞིང་རྣམ་མི་རྟོག །
en: {22} “Your Dharma body is completely pure, The same in all three times, without conceptualization.

source: དེར་ནི་འཇིག་རྟེན་མ་ལུས་ཀུན་འདུས་ཏེ། །འབྱུང་ཞིང་རྣམ་པར་འཇིག་ཀྱང་ཆགས་མི་མངའ། །
en: Every world without exception is contained within it Without creation, destruction, or abiding.

source: ལམ་རྒྱུད་འབྱམ་ཀླས་ཐམས་ཅད་ཀུན་ཏུ་ཡང་། །ཁྱོད་ཀྱི་སྐུ་ནི་གཟུགས་བརྙན་རྣམ་པར་ཕྱེ། །སྐར་ཆེན་ཟླ་སྐར་རྒྱུ་སྐར་ཚོགས་ལ་ཇི་བཞིན་དུ། །སྤུ་རྩེ་ཀུན་ལའང་ཁྱོད་ནི་བདག་གིས་མཐོང་། །
en: {23} “I see the image of your body dispersed Throughout the whole extent of existences, And I see within the pores of your body The constellations of stars with the moon and planets.

source: ཁྱོད་ཀྱི་ཐུགས་ཡངས་ཤིན་ཏུ་རྣམ་དག་སྟེ། །ཕྱོགས་རྣམས་ཀུན་ཏུ་ནམ་མཁའི་དབྱིངས་སུ་རྒྱས། །
en: {24} “Your mind also is completely pure, Pervading the realm of space in all directions.

source: དེར་ནི་མི་མཆོག་ཀུན་ཀྱང་ཡོངས་སུ་འདུ། །
en: Even the supreme among humans are all included within it.

source: ཁྱོད་ལ་ཡེ་ཤེས་མི་རྟོག་དམ་པ་མངའ། །
en: You possess the supreme wisdom free of concepts.

source: ཞིང་གི་རྡུལ་སྙེད་རྣམ་པ་སྣ་ཚོགས་སྤྲིན། །ཁྱོད་ཀྱི་སྤུ་རྩེ་ཀུན་ནས་མངོན་འཐོན་ཅིང་། རྒྱན་མངས་སྣ་ཚོགས་ཆར་པ་མངོན་འབེབས་ཤིང་། །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཞབས་དྲུང་རྒྱས་པར་འགེངས། །
en: {25} “Multicolored clouds as numerous as the atoms in a realm Arise out of all the pores of your body, Spread to the buddhas in the ten directions, And send down a rainfall of all adornments.

source: འགྲོ་བ་ཀུན་སྙེད་ལུས་རྣམས་མཐའ་ཡས་བ། །ཁྱོད་ཀྱི་སྤུ་རྩེ་ཀུན་ནས་མངོན་འཐོན་ཅིང་། །
en: {26} “The endless number of the bodies as numerous as beings Arise out of the pores of your body.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་རྒྱས་པར་ཡོངས་བཀང་ནས། །སྣ་ཚོགས་ཐབས་ཀྱིས་སེམས་ཅན་རྣམ་པར་སྤྱོད། །
en: They pervade and fill the worlds in the ten directions And purify beings through various methods.

source: སྤུ་རྩེ་ཀུན་ལ་བསམ་ཡས་ཞིང་གི་རྣམས། །སྣ་ཚོགས་རྒྱན་ལྡན་རྣམ་པ་ཐ་དད་མཐོང་། །
en: {27} “I see an inconceivable number of realms With various different displays in all your pores.

source: ལམ་རྒྱུད་སེམས་ཅན་ཁྱོད་ཀྱིས་རྣམ་སྦྱངས་པ། །ཇི་སྙེད་དེ་དག་བསམས་བཞིན་ཀུན་ཀྱང་བྱུང་། །
en: They appear in accordance with all the aspirations Of those you purify in the various existences of beings.

source: གང་ཞིག་ཁྱོད་ཀྱི་མཚན་ཐོས་དགའ་གྱུར་པ། །དེ་དག་ཐོབ་བྱ་ལེགས་ཐོབ་ལེགས་པར་འཚོ། །
en: {28} “Whoever rejoices on hearing your name Will easily attain their goals and live well.
